app/controllers/api/v1/vessels.rb

    class Vessels < Grape::API
      desc 'Fetch all vessels'
      get '/vessels' do
        vessels = Vessel.all
---
SELECT "vessels".* FROM "vessels"

      end

      get '/vessels/show' do
        vessel = Vessel.where(id: params[:id])
---
SELECT "vessels".* FROM "vessels" WHERE "vessels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]


      post '/vessels/create' do
        vessel = Vessel.new(params)
        if vessel.save
---
INSERT INTO "vessels" ("name", "owner_id", "naccs_code", "start_location", "destination", "ship_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

      end

      put '/vessels/update' do
        vessel = Vessel.find(params[:id])
        if vessel.update(params)
---
SELECT "vessels".* FROM "vessels" WHERE "vessels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "vessels" SET "name" = $1, "updated_at" = $2 WHERE "vessels"."id" = $3  [["name", "Selene1"], ["updated_at", "2023-09-03 02:48:13.293834"], ["id", 1]]

      end

      delete '/vessels/destroy' do
        vessel = Vessel.find_by(id: params[:id])

        return error!('record is not availabl', 404) if vessel.nil?

        if vessel.destroy
---
SELECT "vessels".* FROM "vessels" WHERE "vessels"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "vessels" WHERE "vessels"."id" = $1  [["id", 20]]