app/controllers/api/v1/vessel_trackings.rb

        requires :vessel_id, type: Integer, desc: 'vessel_id'
      end
      get '/vessel_trackings' do
        vt = VesselTracking.where(vessel_id: params[:vessel_id])
---
SELECT "vessel_trackings".* FROM "vessel_trackings" WHERE "vessel_trackings"."vessel_id" = $1  [["vessel_id", 1]]


      post '/vessel_trackings/create' do
        vt = VesselTracking.new(params)
        if vt.save
---
INSERT INTO "vessel_trackings" ("vessel_id", "next_port", "eta", "speed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["vessel_id", 1], ["next_port", "Krystal01"], ["eta", "2023-09-05 02:21:51 UTC"], ["speed", "24 KM"], ["created_at", "2023-09-03 03:08:55.195742"], ["updated_at", "2023-09-03 03:08:55.195742"]]

      end

      put '/vessel_trackings/update' do
        vt = VesselTracking.find(params[:id])
        if vt.update(params)
---
SELECT "vessel_trackings".* FROM "vessel_trackings" WHERE "vessel_trackings"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
UPDATE "vessel_trackings" SET "eta" = $1, "updated_at" = $2 WHERE "vessel_trackings"."id" = $3  [["eta", "2023-09-06 02:21:51 UTC"], ["updated_at", "2023-09-03 03:12:04.933049"], ["id", 21]]

      end

      delete '/vessel_trackings/destroy' do
        vt = VesselTracking.find_by(id: params[:id])
---
SELECT "vessel_trackings".* FROM "vessel_trackings" WHERE "vessel_trackings"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]